---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.FormulaDrivenDimension
source: html/af3c3dc4-6100-2a35-0e00-47c6185650f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.FormulaDrivenDimension Property

Dimension can't be driven by a formula parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId FormulaDrivenDimension { get; }
```